import React from "react";

const PrivacyPolicy = () => {
  return (
    <div className="mt-16 dark:bg-[#0b1324] p-10">
      <h1 className="text-black dark:text-white py-10">প্রাইভেসি পলিসি</h1>

      <h3 className="dark:text-[#38bdf8] text-[#6d28d9] font-bold mb-5">
        1. একাউন্ট/প্রোফাইল ক্রিডেনশিয়ালস:
      </h3>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d] ">
        মার্ন স্ট্যাক প্রশ্নপত্র ওয়েবসাইটে (proshnopotro.com) আমাদের প্রধান
        অগ্রাধিকারগুলির মধ্যে একটি হল আমাদের ইউজারদের তথ্যের গোপনীয়তা। লার্ন
        উইথ সুমিত ওয়েবসাইট থেকে আমরা কি কি তথ্য সংগ্রহণ করি এবং কীভাবে সেটি
        ব্যবহার করি, সে সম্পর্কে বিস্তারিত তথ্য এই ডকুমেন্টে রয়েছে।
      </p>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d] ">
        এই প্রাইভেসি পলিসি শুধুমাত্র আমাদের অনলাইন ক্রিয়াকলাপের ক্ষেত্রে
        প্রযোজ্য এবং আমাদের ওয়েবসাইটের দর্শকরা যে তথ্যগুলি শেয়ার করেছেন
        এবং/অথবা মার্ন স্ট্যাক প্রশ্নপত্র ওয়েবসাইট থেকে সংগ্রহ করেছেন সেগুলির
        জন্য বৈধ৷ এই নীতি অফলাইনে বা এই ওয়েবসাইট ছাড়া অন্য চ্যানেলের মাধ্যমে
        সংগ্রহ করা কোনো তথ্যের ক্ষেত্রে প্রযোজ্য নয়।
      </p>

      <h3 className="dark:text-[#38bdf8] text-[#6d28d9] font-bold mb-5">
        সম্মতি
      </h3>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d] ">
        আমাদের ওয়েবসাইট ব্যবহার করে, আপনি এতদ্বারা আমাদের প্রাইভেসি পলিসি এবং
        শর্তাবলীতে সম্মত হচ্ছেন বলে ধরে নেয়া হবে।
      </p>

      <h3 className="dark:text-[#38bdf8] text-[#6d28d9] font-bold mb-5">
        আমরা কি কি তথ্য সংগ্রহ করি
      </h3>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d] ">
        আমরা যখন ওয়েবসাইটে আপনাকে আপনার ব্যক্তিগত তথ্য প্রদান করতে বলব, তখনই
        আপনাকে স্পষ্ট করে দেওয়া হবে কেন আপনাকে এটি প্রদান করতে বলা হয়েছে।
      </p>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d]">
        আপনি যদি সরাসরি আমাদের সাথে যোগাযোগ করেন, আমরা আপনার সম্পর্কে অতিরিক্ত
        তথ্য নিতে পারি যেমন আপনার নাম, ইমেল ঠিকানা, ফোন নম্বর, যোগাযোগের
        বিষয়বস্তু এবং/অথবা যেকোন সংযুক্তি অথবা অন্য যেকোন তথ্য যেগুলো আপনি
        আমাদের পাঠাচ্ছেন।
      </p>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d]">
        যখন আপনি আমাদের ওয়েবসাইটে একাউন্ট খুলবেন তখন আপনাকে কিছু ব্যক্তিগত তথ্য
        প্রদান করতে হবে যেমন আপনার নাম, ইমেইল এড্রেস, ছবি, মোবাইল নাম্বার,
        ডিসকোর্ড ইউজারনেম, ঠিকানা ইত্যাদি। এর বাইরেও পরবর্তীতে আমরা প্রয়োজনের
        ভিত্তিতে অতিরিক্ত তথ্য চাইতে পারি আপনার অনুমতি নিয়ে। আমরা আপনার অনুমতি
        ব্যতীত আপনার তথ্য কারো কাছে শেয়ার করিনা এবং তথ্যের গোপনীয়তা বজায় রাখি।
      </p>

      <h3 className="dark:text-[#38bdf8] text-[#6d28d9] font-bold mb-5">
        ব্যক্তিগত পাসওয়ার্ডের গোপনীয়তা
      </h3>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d]">
        আমাদের ওয়েবসাইটে একাউন্ট খোলার সময় লগইন করার জন্য আপনাকে যে পাসওয়ার্ড
        দিতে বলা হবে সেটি আমরা আমাদের ডাটাবেজে সংরক্ষণ করার সময় এনক্রিপ্ট করে
        সিকিউরড ভাবে সংরক্ষণ করি। যার ফলে আপনার পাসওয়ার্ডের আসল কন্টেন্ট আমরা
        নিজেরাও দেখতে পাইনা। তাই আমাদের ওয়েবসাইটে আপনার পাসওয়ার্ডের গোপনীয়তা
        সঠিকভাবে রক্ষা করা হয়। এছাড়া আপনার পাসওয়ার্ড এর গোপনীয়তা রক্ষা করার জন্য
        কখনও আপনার পাসওয়ার্ড কারো সাথে শেয়ার না করার অনুরোধ করছি। যদি আপনি মনে
        করেন আপনার পাসওয়ার্ড কোন ভাবে আপনার কাছে থেকে অন্য কেউ পেয়ে গেছে, সাথে
        সাথে ওয়েবসাইট থেকে পাসওয়ার্ড পরিবর্তন করুন। যদি আপনি কোনভাবে পাসওয়ার্ড
        পরিবর্তন করতে ব্যর্থ হন, আমাদের সাপোর্ট এ যোগাযোগ করুন।
      </p>

      <h3 className="dark:text-[#38bdf8] text-[#6d28d9] font-bold mb-5">
        আমরা কিভাবে আপনার তথ্য গুলো ব্যবহার করি
      </h3>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d]">
        আমরা আপনার থেকে যে তথ্য সংগ্রহ করি সেগুলো বিভিন্ন ভাবে ব্যবহার করি যেমন:
      </p>

      <h3 className="dark:text-[#38bdf8] text-[#6d28d9] font-bold mb-5">
        লগ ফাইল
      </h3>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d]">
        মার্ন স্ট্যাক প্রশ্নপত্র লগ ফাইল ব্যবহার করার একটি আদর্শ পদ্ধতি অনুসরণ
        করে। যখন ভিজিটর ওয়েবসাইট পরিদর্শন করে,এই ফাইল ভিজিটর লগ সংরক্ষণ করে।
        সমস্ত হোস্টিং কোম্পানি এটি করে এবং এটি হোস্টিং পরিষেবা বিশ্লেষণের একটি
        অংশ। লগ ফাইল যে যে তথ্য সংরক্ষণ করে তার মধ্যে রয়েছে - ইন্টারনেট প্রটোকল
        বা আইপি (IP) এড্রেস, ব্রাউজার এর ধরণ, ইন্টারনেট সার্ভিস প্রোভাইডার,
        তারিখ এবং সময়, রেফারিং পেজ ইত্যাদি। এগুলি ব্যক্তিগতভাবে শনাক্তযোগ্য এমন
        কোনও তথ্যের সাথে সংযুক্ত নয়৷ এসব তথ্যের উদ্দেশ্য হল ট্রেন্ড/প্রবণতা
        বিশ্লেষণ করা, সাইট পরিচালনা করা, ওয়েবসাইটে ব্যবহারকারীদের গতিবিধি
        ট্র্যাক করা এবং ডেমোগ্রাফিক সংক্রান্ত তথ্য সংগ্রহ করা।
      </p>

      <h3 className="dark:text-[#38bdf8] text-[#6d28d9] font-bold mb-5">
        কুকিজ
      </h3>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d]">
        অন্যান্য সকল ওয়েবসাইটের মতো মার্ন স্ট্যাক প্রশ্নপত্র ওয়েবসাইট ও ব্রাউজার
        কুকিজ ('cookies') ব্যবহার করছে। এই কুকিগুলি ভিজিটরদের পছন্দ এবং
        ওয়েবসাইটের পৃষ্ঠাগুলি যা ভিজিটর অ্যাক্সেস করেছে বা পরিদর্শন করেছে
        সেগুলি সহ তথ্য সংরক্ষণ করতে ব্যবহৃত হয়। তথ্যগুলো দর্শকদের ব্রাউজারের
        ধরন এবং/অথবা অন্যান্য তথ্যের উপর ভিত্তি করে আমাদের ওয়েব পেজের
        বিষয়বস্তু কাস্টমাইজ করে ব্যবহারকারীদের অভিজ্ঞতা অপ্টিমাইজ করতে ব্যবহার
        করা হয়।
      </p>

      <h3 className="dark:text-[#38bdf8] text-[#6d28d9] font-bold mb-5">
        শিশুদের তথ্যের গোপনীয়তা
      </h3>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d]">
        আমাদের অগ্রাধিকারের আরেকটি অংশ হল ইন্টারনেট ব্যবহার করার সময় শিশুদের
        জন্য সুরক্ষা যোগ করা। আমরা পিতামাতা এবং অভিভাবকদের তাদের অনলাইন
        কার্যকলাপ পর্যবেক্ষণ, অংশগ্রহণ, এবং/অথবা নিরীক্ষণ এবং গাইড করার জন্য
        উৎসাহিত করি।
      </p>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d]">
        মার্ন স্ট্যাক প্রশ্নপত্র তেরো (13) বছরের কম বয়সী শিশুদের কাছ থেকে
        জেনেশুনে কোনো ব্যক্তিগত শনাক্তযোগ্য তথ্য সংগ্রহ করে না। আপনি যদি মনে
        করেন যে আপনার সন্তান আমাদের ওয়েবসাইটে এই ধরনের তথ্য প্রদান করেছে, আমরা
        আপনাকে অবিলম্বে আমাদের সাথে যোগাযোগ করার জন্য জোরালোভাবে উৎসাহিত করি এবং
        আমরা আমাদের রেকর্ড থেকে অবিলম্বে এই ধরনের তথ্য মুছে ফেলার জন্য আমাদের
        যথাসাধ্য চেষ্টা করব।
      </p>
    </div>
  );
};

export default PrivacyPolicy;
