import React from "react";

const RefundPolicy = () => {
  return (
    <div className="mt-16 dark:bg-[#0b1324] p-10">
      <h1 className="text-black dark:text-white py-10">রিফান্ড পলিসি</h1>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d] ">
        1.1) বইটি ক্রয় করার সর্বোচ্চ 5 দিনের মধ্যে রিফান্ড রিকুয়েস্ট করা যাবে।
        যদি আপনি ক্রয় করার 5 দিনের মধ্যে রিফান্ড রিকুয়েস্ট করেন, তাহলে
        নিঃশর্তভাবে আপনার বই মূল্য রিফান্ড করে দেয়া হবে।
      </p>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d] ">
        1.2) রিফান্ড এর টাকা কোনভাবেই সরাসরি ক্যাশ ট্রানজেকশন করা হবে না। আপনি
        আমাদের প্লাটফর্ম থেকে আপনার পছন্দের পেমেন্ট চ্যানেলে পেমেন্ট করতে পারবেন
        এবং রিফান্ড দেয়ার সময় আপনি যে মাধ্যমে পেমেন্ট করেছিলেন, সেই মাধ্যমেই
        রিফান্ড করার চেষ্টা করা হবে। রিফান্ড করতে গিয়ে সংশ্লিষ্ট মাধ্যমে কোন
        সার্ভিস চার্জ প্রযোজ্য হলে সেই চার্জ কাস্টোমারকে বহন করতে হবে।
      </p>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d] ">
        1.3) আপনি আমাদের ওয়েবসাইট থেকে সরাসরি রিফান্ড রিকুয়েস্ট করতে পারবেন।
        রিফান্ডের অনুরোধ মার্ন স্ট্যাক প্রশ্নপত্র - কর্তৃপক্ষ দ্বারা সফলভাবে
        প্রক্রিয়াকৃত এবং অনুমোদিত হওয়ার সর্বোচ্চ 7-10 কার্যদিবসের মধ্যে
        ব্যবহারকারী যে মাধ্যমে পেমেন্ট করেছিলেন সেই একই মাধ্যমে অর্থ ফেরত দেয়া
        হবে এবং নিশ্চিতকরণ ইমেলের মাধ্যমে ব্যবহারকারীকে জানানো হবে। রিফান্ড করতে
        গিয়ে সংশ্লিষ্ট মাধ্যমে কোন সার্ভিস চার্জ প্রযোজ্য হলে সেই চার্জ
        কাস্টোমারকে বহন করতে হবে।
      </p>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d] ">
        1.4) আপনার বই মূল্য রিফান্ড রিকুয়েস্টটি সফল হবার পর আপনি আমাদের
        প্লাটফর্মের সমস্ত এক্সেস হারাবেন এবং আমাদের প্লাটফর্মে আর লগইন করতে
        পারবেন না।
      </p>
      <p className="mb-5 font-[600] text-[#515d6f]  dark:text-[#7a899d] ">
        1.5) বইটি ক্রয় করার পূর্বে বইয়ের কারিকুলাম দেখে নিবেন, অন্যথায় পরবর্তীতে
        ডেডলাইন শেষে বই কারিকুলাম বিষয়ে কোন অভিযোগের কারণে রিফান্ড রিকুয়েস্ট
        গ্রহন করা হবে না। "আমি ওয়েবসাইটের এই জায়গাটা দেখিনি, ভাল করে পড়ে দেখিনি,
        সময় পাইনি, আমার চোখ এড়িয়ে গেছে" - এধরণের কোন অনুরোধ আমাদের কাছে
        গ্রহণযোগ্য হবেনা।
      </p>
    </div>
  );
};

export default RefundPolicy;
