import React from "react";
import Faq from "../../../public/chawa.svg";
import Accordion from "../../Components/Accordion ";

const FAQ = () => {
  return (
    <div id="FAQ" className="lg:flex items-center justify-between m-8">
      <div className="lg:w-1/2">
        <img src={Faq} alt="" data-aos="fade-down" className="w-1/3" />
        <h1 className="dark:text-white text-[25px] lg:text-[32px] ">
          সচরাচর জানতে চাওয়া{" "}
          <span className="primary-highlighter dark:text-[#38bdf8]">
            প্রশ্নের উত্তর
          </span>
        </h1>
        <p className="text-primary-color dark:text-[#7a899d]">
          আপনাদের কমন কিছু প্রশ্নের উত্তর আমরা এখানে লিস্ট করে দিয়েছি। আমাদের কে
          প্রশ্ন করার পূর্বে এই লিস্টটি একবার পড়ে নেয়ার অনুরোধ থাকলো। তাহলে
          আমাদের উত্তরের জন্য আপনাকে অপেক্ষা করতে হবেনা এবং আপনার মূল্যবান সময়
          বেঁচে যাবে।
        </p>
      </div>

      <div className="h-[400px] overflow-hidden overflow-y-auto custom-scrollbar my-10">
        <Accordion
          title={"কোর্সটি করার জন্য আগে থেকে কি কি জানতে হবে?"}
          content={
            "কোর্সটি করার জন্য বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>ES6) জাভাস্ক্রিপ্ট, DOM, রিয়্যাক্ট জেএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।"
          }
        ></Accordion>
        <Accordion
          title={"কোর্সের প্রথম ক্লাস কবে থেকে শুরু হবে?"}
          content={
            "কোর্সের প্রথম ক্লাস শুরু হবে 18 ফেব্রুয়ারি 2023 তারিখ রাত 11:59 মিনিট থেকে। এই সময় থেকে প্রতি সপ্তাহে দুইটি করে মডিউল রিলিজ দেয়া হবে।"
          }
        ></Accordion>
        <Accordion
          title={"কোর্সের ভিডিওগুলো কিভাবে দেয়া হবে?"}
          content={
            "কোর্সের ভিডিওগুলো আগে থেকে রেকোর্ডেড থাকবে। আপনি এনরোল করার পর আপনাকে দেয়া লগইন ইনফরমেশন দিয়ে লগইন করে আপনি ভিডিও গুলো যথা সময়ে দেখতে পারবেন। প্রতি সপ্তাহে 1-2টি মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি ভিডিও থাকবে। এই ভিডিওগুলো আপনাকে সপ্তাহের প্রথম 5 দিনের মধ্যে দেখা শেষ করতে হবে যেন বাকি 2 দিনে মডিউল শেষে দেয়া এসাইনমেন্ট করে জমা দিতে পারেন।"
          }
        ></Accordion>{" "}
        <Accordion
          title={"কোর্সটি করতে আপনার কি কি থাকা লাগবে?"}
          content={
            "প্রতিটি ভিডিওর সাথে কুইজ থাকবে এবং নিজের প্রগ্রেস বুঝার জন্য আপনাকে কুইজগুলোর উত্তর দিতে হবে। এছাড়া প্রতিটি মডিউল শেষে একটি করে বড়/মাঝারি এসাইনমেন্ট থাকবে এবং আপনাদেরকে 36 ঘণ্টার মধ্যে এসাইনমেন্ট করে সোর্স কোড এর গিটহাব রিপোসিটরি লিঙ্ক জমা দিতে হবে। এছাড়া পুরো কোর্স এর একদম শেষে একটি ফাইনাল পরীক্ষা নেয়া হবে অনলাইনে। সব এসাইনমেন্ট এবং ফাইনাল পরীক্ষার প্রাপ্ত নম্বর যোগ করে ফাইনাল রেজাল্ট নির্ধারণ করা হবে।"
          }
        ></Accordion>{" "}
        <Accordion
          title={"কোর্স ফি কতো?"}
          content={
            "কোর্সটি করার জন্য বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>ES6) জাভাস্ক্রিপ্ট, DOM, রিয়্যাক্ট জেএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।"
          }
        ></Accordion>{" "}
        <Accordion
          title={"কোর্স ফি কি কোর্সের আগে একবারে পুরোটা পরিশোধ করতে হবে?"}
          content={
            "কোর্সটি করার জন্য বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>ES6) জাভাস্ক্রিপ্ট, DOM, রিয়্যাক্ট জেএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।"
          }
        ></Accordion>{" "}
        <Accordion
          title={"কোর্স ফি কি ফেরতযোগ্য?"}
          content={
            "কোর্সটি করার জন্য বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>ES6) জাভাস্ক্রিপ্ট, DOM, রিয়্যাক্ট জেএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।"
          }
        ></Accordion>{" "}
        <Accordion
          title={"কোর্স ফি তে কি কোন ডিসকাউন্ট দেয়া হবে?"}
          content={
            "কোর্সটি করার জন্য বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>ES6) জাভাস্ক্রিপ্ট, DOM, রিয়্যাক্ট জেএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।"
          }
        ></Accordion>
        <Accordion
          title={"কোর্সটি করার জন্য আগে থেকে কি কি জানতে হবে?"}
          content={
            "কোর্সটি করার জন্য বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>ES6) জাভাস্ক্রিপ্ট, DOM, রিয়্যাক্ট জেএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।"
          }
        ></Accordion>
        <Accordion
          title={"কোর্সের প্রথম ক্লাস কবে থেকে শুরু হবে?"}
          content={
            "কোর্সের প্রথম ক্লাস শুরু হবে 18 ফেব্রুয়ারি 2023 তারিখ রাত 11:59 মিনিট থেকে। এই সময় থেকে প্রতি সপ্তাহে দুইটি করে মডিউল রিলিজ দেয়া হবে।"
          }
        ></Accordion>
        <Accordion
          title={"কোর্সের ভিডিওগুলো কিভাবে দেয়া হবে?"}
          content={
            "কোর্সের ভিডিওগুলো আগে থেকে রেকোর্ডেড থাকবে। আপনি এনরোল করার পর আপনাকে দেয়া লগইন ইনফরমেশন দিয়ে লগইন করে আপনি ভিডিও গুলো যথা সময়ে দেখতে পারবেন। প্রতি সপ্তাহে 1-2টি মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি ভিডিও থাকবে। এই ভিডিওগুলো আপনাকে সপ্তাহের প্রথম 5 দিনের মধ্যে দেখা শেষ করতে হবে যেন বাকি 2 দিনে মডিউল শেষে দেয়া এসাইনমেন্ট করে জমা দিতে পারেন।"
          }
        ></Accordion>{" "}
        <Accordion
          title={"কোর্সটি করতে আপনার কি কি থাকা লাগবে?"}
          content={
            "প্রতিটি ভিডিওর সাথে কুইজ থাকবে এবং নিজের প্রগ্রেস বুঝার জন্য আপনাকে কুইজগুলোর উত্তর দিতে হবে। এছাড়া প্রতিটি মডিউল শেষে একটি করে বড়/মাঝারি এসাইনমেন্ট থাকবে এবং আপনাদেরকে 36 ঘণ্টার মধ্যে এসাইনমেন্ট করে সোর্স কোড এর গিটহাব রিপোসিটরি লিঙ্ক জমা দিতে হবে। এছাড়া পুরো কোর্স এর একদম শেষে একটি ফাইনাল পরীক্ষা নেয়া হবে অনলাইনে। সব এসাইনমেন্ট এবং ফাইনাল পরীক্ষার প্রাপ্ত নম্বর যোগ করে ফাইনাল রেজাল্ট নির্ধারণ করা হবে।"
          }
        ></Accordion>{" "}
        <Accordion
          title={"কোর্স ফি কতো?"}
          content={
            "কোর্সটি করার জন্য বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>ES6) জাভাস্ক্রিপ্ট, DOM, রিয়্যাক্ট জেএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।"
          }
        ></Accordion>{" "}
        <Accordion
          title={"কোর্স ফি কি কোর্সের আগে একবারে পুরোটা পরিশোধ করতে হবে?"}
          content={
            "কোর্সটি করার জন্য বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>ES6) জাভাস্ক্রিপ্ট, DOM, রিয়্যাক্ট জেএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।"
          }
        ></Accordion>{" "}
        <Accordion
          title={"কোর্স ফি কি ফেরতযোগ্য?"}
          content={
            "কোর্সটি করার জন্য বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>ES6) জাভাস্ক্রিপ্ট, DOM, রিয়্যাক্ট জেএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।"
          }
        ></Accordion>{" "}
        <Accordion
          title={"কোর্স ফি তে কি কোন ডিসকাউন্ট দেয়া হবে?"}
          content={
            "কোর্সটি করার জন্য বেসিক এইচ.টি.এম.এল, সি.এস.এস, বেসিক জাভাস্ক্রিপ্ট, মডার্ন (>ES6) জাভাস্ক্রিপ্ট, DOM, রিয়্যাক্ট জেএস, npm, Git/GitHub সম্পর্কে ধারণা এবং VSCode এডিটরে কাজ করার অভিজ্ঞতা থাকতে হবে। বিস্তারিত এখান থেকে জানুন।"
          }
        ></Accordion>
      </div>
    </div>
  );
};

export default FAQ;
