import React from "react";
import howDosesWork from "../../../public/howDosesWork.svg";
import Center from "../../Components/Center";
import arrow from "../../../public/arrow.png";
import one from "../../../public/1.gif";
import how2 from "../../../public/2.gif";
import three from "../../../public/3.gif";
import four from "../../../public/4.gif";
import five from "../../../public/5.gif";
import finalExam from "../../../public/6.gif";
import HowToRead from "../../Components/HowToRead";
import HowToReadTow from "../../Components/HowToReadTow";

const HowDosesWork = () => {
  return (
    <div id="howDosesWork">
      <Center
        topImg={howDosesWork}
        firstText={"বইটি"}
        heading={"কিভাবে পড়বে।"}
        title={"যেভাবে আপনি ইন্টাভিউতে ১০০% সাফল্য অর্জন করতে পারবেন। "}
      ></Center>

      <HowToRead
        leftImage={one}
        readNumber={"1"}
        readTitle={" ধাপে ধাপে প্রজেক্ট ভিত্তিক শেখানোর পদ্ধতি"}
        readDescription={
          " প্রতি সপ্তাহে দুটি করে মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি প্রি-রেকোর্ডেড ভিডিও থাকবে যেন আপনারা ধাপে ধাপে একটার পর একটা টপিক শিখতে পারেন। ভিডিও গুলো প্রজেক্ট ভিত্তিক লার্নিং প্রসেস ফলো করে বানানো হয়েছে। সপ্তাহে দুটি করে মডিউল শেষ করার জন্য আপনারা ৫ দিন করেসময় পাবেন কারণ সপ্তাহের বাকি 2টি দিন এসাইনমেন্ট এবং লাইভ সেশনের জন্য থাকবে।"
        }
        arrowImage={arrow}
      ></HowToRead>

      <HowToReadTow
        rightImage={how2}
        readNumber={"2"}
        readTitle={"  ধাপে ধাপে প্রজেক্ট ভিত্তিক শেখানোর পদ্ধতি"}
        readDescription={
          "প্রতি সপ্তাহে দুটি করে মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি প্রি-রেকোর্ডেড ভিডিও থাকবে যেন আপনারা ধাপে ধাপে একটার পর একটা টপিক শিখতে পারেন। ভিডিও গুলো প্রজেক্ট ভিত্তিক লার্নিং প্রসেস ফলো করে বানানো হয়েছে। সপ্তাহে দুটি করে মডিউল শেষ করার জন্য আপনারা ৫ দিন করেসময় পাবেন কারণ সপ্তাহের বাকি 2টি দিন এসাইনমেন্ট এবং লাইভ সেশনের জন্য থাকবে।"
        }
        arrowImage={arrow}
      ></HowToReadTow>

      <HowToRead
        leftImage={three}
        readNumber={"3"}
        readTitle={" ধাপে ধাপে প্রজেক্ট ভিত্তিক শেখানোর পদ্ধতি"}
        readDescription={
          " প্রতি সপ্তাহে দুটি করে মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি প্রি-রেকোর্ডেড ভিডিও থাকবে যেন আপনারা ধাপে ধাপে একটার পর একটা টপিক শিখতে পারেন। ভিডিও গুলো প্রজেক্ট ভিত্তিক লার্নিং প্রসেস ফলো করে বানানো হয়েছে। সপ্তাহে দুটি করে মডিউল শেষ করার জন্য আপনারা ৫ দিন করেসময় পাবেন কারণ সপ্তাহের বাকি 2টি দিন এসাইনমেন্ট এবং লাইভ সেশনের জন্য থাকবে।"
        }
        arrowImage={arrow}
      ></HowToRead>
      <HowToRead
        leftImage={three}
        readNumber={"3"}
        readTitle={" ধাপে ধাপে প্রজেক্ট ভিত্তিক শেখানোর পদ্ধতি"}
        readDescription={
          " প্রতি সপ্তাহে দুটি করে মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি প্রি-রেকোর্ডেড ভিডিও থাকবে যেন আপনারা ধাপে ধাপে একটার পর একটা টপিক শিখতে পারেন। ভিডিও গুলো প্রজেক্ট ভিত্তিক লার্নিং প্রসেস ফলো করে বানানো হয়েছে। সপ্তাহে দুটি করে মডিউল শেষ করার জন্য আপনারা ৫ দিন করেসময় পাবেন কারণ সপ্তাহের বাকি 2টি দিন এসাইনমেন্ট এবং লাইভ সেশনের জন্য থাকবে।"
        }
        arrowImage={arrow}
      ></HowToRead>
      <HowToReadTow
        rightImage={four}
        readNumber={"4"}
        readTitle={"  ধাপে ধাপে প্রজেক্ট ভিত্তিক শেখানোর পদ্ধতি"}
        readDescription={
          "প্রতি সপ্তাহে দুটি করে মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি প্রি-রেকোর্ডেড ভিডিও থাকবে যেন আপনারা ধাপে ধাপে একটার পর একটা টপিক শিখতে পারেন। ভিডিও গুলো প্রজেক্ট ভিত্তিক লার্নিং প্রসেস ফলো করে বানানো হয়েছে। সপ্তাহে দুটি করে মডিউল শেষ করার জন্য আপনারা ৫ দিন করেসময় পাবেন কারণ সপ্তাহের বাকি 2টি দিন এসাইনমেন্ট এবং লাইভ সেশনের জন্য থাকবে।"
        }
        arrowImage={arrow}
      ></HowToReadTow>
      <HowToRead
        leftImage={five}
        readNumber={"5"}
        readTitle={" ধাপে ধাপে প্রজেক্ট ভিত্তিক শেখানোর পদ্ধতি"}
        readDescription={
          " প্রতি সপ্তাহে দুটি করে মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি প্রি-রেকোর্ডেড ভিডিও থাকবে যেন আপনারা ধাপে ধাপে একটার পর একটা টপিক শিখতে পারেন। ভিডিও গুলো প্রজেক্ট ভিত্তিক লার্নিং প্রসেস ফলো করে বানানো হয়েছে। সপ্তাহে দুটি করে মডিউল শেষ করার জন্য আপনারা ৫ দিন করেসময় পাবেন কারণ সপ্তাহের বাকি 2টি দিন এসাইনমেন্ট এবং লাইভ সেশনের জন্য থাকবে।"
        }
        arrowImage={arrow}
      ></HowToRead>
      <HowToReadTow
        rightImage={finalExam}
        readNumber={"6"}
        readTitle={"  ধাপে ধাপে প্রজেক্ট ভিত্তিক শেখানোর পদ্ধতি"}
        readDescription={
          "প্রতি সপ্তাহে দুটি করে মডিউল রিলিজ দেয়া হবে এবং প্রতিটি মডিউলে 10-12টি প্রি-রেকোর্ডেড ভিডিও থাকবে যেন আপনারা ধাপে ধাপে একটার পর একটা টপিক শিখতে পারেন। ভিডিও গুলো প্রজেক্ট ভিত্তিক লার্নিং প্রসেস ফলো করে বানানো হয়েছে। সপ্তাহে দুটি করে মডিউল শেষ করার জন্য আপনারা ৫ দিন করেসময় পাবেন কারণ সপ্তাহের বাকি 2টি দিন এসাইনমেন্ট এবং লাইভ সেশনের জন্য থাকবে।"
        }
        arrowImage={arrow}
      ></HowToReadTow>
    </div>
  );
};

export default HowDosesWork;
